In [1]:
# Importing libraries

import pandas as pd

In [2]:
#  CDHDR contains general information for the change such as time of change and username
df_CDHDR = pd.read_csv('B:/Programming/Processand/Data/CDHDR.csv', dtype=str)

# Drop columns that are unnecessary for our challenge:
columns = ['OBJECTCLAS','UTIME','TCODE']
df_CDHDR = df_CDHDR.drop(columns, axis = 1)

print(df_CDHDR.shape)
df_CDHDR.head(n=5)

(53293, 4)

  MANDANT    OBJECTID    CHANGENR     UDATE
0     100  0033015440  0165713807  20220310
1     100  0030657319  0165673474  20220308
2     100  0030656642  0164833689  20220221
3     100  4501116647  0163546904  20220202
4     100  0030655315  0164869495  20220223

In [3]:
# CDPOS links to the changed document
df_CDPOS = pd.read_csv('B:/Programming/Processand/Data/CDPOS.csv', dtype = str)

# Drop columns that are unnecessary for our challenge:
columns = ['OBJECTCLAS','CHNGIND']
df_CDPOS = df_CDPOS.drop(columns, axis = 1)

print(df_CDPOS.shape)
df_CDPOS.head(n=5)

(158111, 8)

,MANDANT,OBJECTID,CHANGENR,TABNAME,TABKEY,FNAME,VALUE_NEW,VALUE_OLD
0,100,4501113714,0163221568,EKPO,100450111371400010,LABNR,122000702 21.12.21,NaN
1,100,4501119196,0165192430,EKKO,1004501119196,KEY,NaN,NaN
2,100,0020577003,0166104981,VBAP,1000020577003000190,KEY,NaN,NaN
3,100,0020575233,0163175850,VBAK,1000020575233,LIFSK,NaN,10
4,100,0023001882,0166058070,VBAP,1000023001882000090,KEY,NaN,NaN

In [4]:
# We filter out unnecessary row for our challenge:

# filter_FNAME = ['NETWR']
# filter_TABNAME = ['EKPO']

filter_FNAME = ['NETWR','KEY']
filter_TABNAME = ['EKPO','EKKO']

df_CDPOS = df_CDPOS[df_CDPOS.FNAME.isin(filter_FNAME) & df_CDPOS.TABNAME.isin(filter_TABNAME)]

print(df_CDPOS.shape)
df_CDPOS.head(n=5)

(26615, 8)

,MANDANT,OBJECTID,CHANGENR,TABNAME,TABKEY,FNAME,VALUE_NEW,VALUE_OLD
1,100,4501119196,0165192430,EKKO,1004501119196,KEY,NaN,NaN
10,100,4501117434,0164001954,EKKO,1004501117434,KEY,NaN,NaN
17,100,4501115709,0163343001,EKPO,100450111570900020,NETWR,49.28,35.00
20,100,4501115398,0163223882,EKPO,100450111539800590,NETWR,34.02,105.48
22,100,4501122969,0168025746,EKKO,1004501122969,KEY,NaN,NaN

In [5]:
# We merge both changes table and drop duplicate columns

changes_info = pd.merge(df_CDPOS, df_CDHDR, on='CHANGENR')

columns = ['MANDANT_y','OBJECTID_y']
changes_info = changes_info.drop(columns, axis = 1)

print(changes_info.shape)
changes_info.head(n=5)

(26615, 9)

,MANDANT_x,OBJECTID_x,CHANGENR,TABNAME,TABKEY,FNAME,VALUE_NEW,VALUE_OLD,UDATE
0,100,4501119196,0165192430,EKKO,1004501119196,KEY,NaN,NaN,20220301
1,100,4501117434,0164001954,EKKO,1004501117434,KEY,NaN,NaN,20220210
2,100,4501115709,0163343001,EKPO,100450111570900020,NETWR,49.28,35.00,20220125
3,100,4501115709,0163343001,EKPO,100450111570900010,NETWR,79.57,40.00,20220125
4,100,4501115398,0163223882,EKPO,100450111539800590,NETWR,34.02,105.48,20220120

In [6]:
# We import EKKO table and drop columns unnecessary for our challenge

df_EKKO = pd.read_csv('B:/Programming/Processand/Data/EKKO.csv', dtype=str)

columns = ['BUKRS','BSTYP','BSART','LOEKZ','STATU','LIFNR']
df_EKKO = df_EKKO.drop(columns, axis = 1)

print(df_EKKO.shape)
df_EKKO.head(n=5)

# Which purchase orders have been created?
# Contains one row for each Purchase Order

(2125, 3)

  MANDT       EBELN     AEDAT
0   100  6000025866  20220131
1   100  6000025604  20220121
2   100  4501115256  20220119
3   100  6000025617  20220121
4   100  4501115969  20220126

In [7]:
# We import EKPO table and drop columns unnecessary for our challenge
# Which Purchase Order Items have been created?
# Contains one row for each Purchase Order Item

df_EKPO = pd.read_csv('B:/Programming/Processand/Data/EKPO.csv', dtype = str)

columns = ['MATNR','BUKRS','WERKS', 'MENGE','NETPR','LABNR']
df_EKPO = df_EKPO.drop(columns, axis = 1)

print(df_EKPO.shape)
df_EKPO.head(n=5)

# Obsahuje podozrivo málo riadkov na to že toto by mal byť hlavný zoznam všetkých objednaných položiek

(153, 4)

  MANDT       EBELN  EBELP    NETWR
0   100  4501114600  00090   100.99
1   100  4501115249  00770  1360.26
2   100  4501115423  00460     0.01
3   100  4501114826  00020      299
4   100  4501115547  00300      210

In [8]:
# We create key for merging with changes table

df_EKPO['TABKEY'] = df_EKPO['MANDT']+df_EKPO['EBELN']+df_EKPO['EBELP']
print(df_EKPO.shape)
df_EKPO.head(n=5)

(153, 5)

  MANDT       EBELN  EBELP    NETWR              TABKEY
0   100  4501114600  00090   100.99  100450111460000090
1   100  4501115249  00770  1360.26  100450111524900770
2   100  4501115423  00460     0.01  100450111542300460
3   100  4501114826  00020      299  100450111482600020
4   100  4501115547  00300      210  100450111554700300

In [9]:
# We merge EKPO with EKKO to get AEDAT

combine_calc_data = pd.merge(df_EKPO, df_EKKO, on='EBELN')

combine_calc_data = combine_calc_data.drop('MANDT_y', axis=1)

print(combine_calc_data.shape)
combine_calc_data.head(n=5)

(153, 6)

  MANDT_x       EBELN  EBELP              NETWR              TABKEY     AEDAT
0     100  4501114600  00090             100.99  100450111460000090  20220111
1     100  4501115249  00770            1360.26  100450111524900770  20220119
2     100  4501115249  00690  80.95999999999999  100450111524900690  20220119
3     100  4501115249  00340              16.48  100450111524900340  20220119
4     100  4501115249  00590             105.48  100450111524900590  20220119

In [10]:
# We merge combine_calc_data (which is merget EKPO and EKKO) with changes_info, to get new prices and new items

combine_calc_data_changes = pd.merge(combine_calc_data, changes_info, on='TABKEY', how='left')
print(combine_calc_data_changes.shape)
combine_calc_data_changes.head(n=5)

(204, 14)

,MANDT_x,EBELN,EBELP,NETWR,TABKEY,AEDAT,MANDANT_x,OBJECTID_x,CHANGENR,TABNAME,FNAME,VALUE_NEW,VALUE_OLD,UDATE
0,100,4501114600,00090,100.99,100450111460000090,20220111,100,4501114600,0164787665,EKPO,KEY,NaN,NaN,20220218
1,100,4501115249,00770,1360.26,100450111524900770,20220119,100,4501115249,0163208260,EKPO,NETWR,1360.26,1811.26,20220119
2,100,4501115249,00770,1360.26,100450111524900770,20220119,100,4501115249,0163206170,EKPO,KEY,NaN,NaN,20220119
3,100,4501115249,00690,80.95999999999999,100450111524900690,20220119,100,4501115249,0163208260,EKPO,NETWR,80.96,107.80,20220119
4,100,4501115249,00690,80.95999999999999,100450111524900690,20220119,100,4501115249,0163205774,EKPO,KEY,NaN,NaN,20220119

In [11]:
# Filling NaN values with NETWR values

combine_calc_data_changes.UDATE.fillna(combine_calc_data_changes.AEDAT, inplace = True)
combine_calc_data_changes.VALUE_NEW.fillna(combine_calc_data_changes.NETWR, inplace = True)
combine_calc_data_changes.VALUE_OLD.fillna(combine_calc_data_changes.NETWR, inplace = True)

# Dropping unnecessary / duplicated columns

columns = ['MANDANT_x','OBJECTID_x','CHANGENR', 'TABNAME']
combine_calc_data_changes = combine_calc_data_changes.drop(columns, axis = 1)

print(combine_calc_data_changes.shape)
combine_calc_data_changes.head(n=5)

# In case of FNAME = KEY, this means the item was newly added. We use the NETWR price to input it into VALUE_NEW
# In case of FNAME = NETWR, the price was in column VALUE_NEW should be actual.

(204, 10)

,MANDT_x,EBELN,EBELP,NETWR,TABKEY,AEDAT,FNAME,VALUE_NEW,VALUE_OLD,UDATE
0,100,4501114600,00090,100.99,100450111460000090,20220111,KEY,100.99,100.99,20220218
1,100,4501115249,00770,1360.26,100450111524900770,20220119,NETWR,1360.26,1811.26,20220119
2,100,4501115249,00770,1360.26,100450111524900770,20220119,KEY,1360.26,1360.26,20220119
3,100,4501115249,00690,80.95999999999999,100450111524900690,20220119,NETWR,80.96,107.80,20220119
4,100,4501115249,00690,80.95999999999999,100450111524900690,20220119,KEY,80.95999999999999,80.95999999999999,20220119

In [12]:
# We change VALUE_NEW and OLD type to float to enable SUM function

combine_calc_data_changes['VALUE_NEW'] = combine_calc_data_changes['VALUE_NEW'].astype(float)
combine_calc_data_changes['VALUE_OLD'] = combine_calc_data_changes['VALUE_OLD'].astype(float)

In [13]:
# Calculating output

input_MANDT = "100"
input_date = "20220119"
input_EBELN = "4501115249"

df0 = combine_calc_data_changes[combine_calc_data_changes['MANDT_x']==input_MANDT]
df1 = df0[df0['AEDAT']==input_date]
df2 = df1[df1['EBELN']==input_EBELN]


total = df2['VALUE_NEW'].sum(axis=0)
total

3767.92

In [14]:
# Creating function to calculate the output

def calculation(input_MANDT, input_date, input_EBELN):
    df0 = combine_calc_data_changes[combine_calc_data_changes['MANDT_x']==input_MANDT]
    df1 = df0[df0['AEDAT']==input_date]
    df2 = df1[df1['EBELN']==input_EBELN]
    return print('Total price according to VALUE_NEW is:',df2['VALUE_NEW'].sum(axis=0),'Total price according to VALUE_OLD is:', df2['VALUE_OLD'].sum(axis=0))

In [15]:
# Using the function

calculation('100','20220119','4501115249')

Total price according to VALUE_NEW is: 3767.92 Total price according to VALUE_OLD is: 4392.54